Yourcomputermaster/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДопНачисление</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_ПодразделенияСотрудников</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Yourcomputermaster/src/CalculationRegisters/ВКМ_ОсновоныеНачисления/ВКМ_ОсновоныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновоныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикРабот</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикРабот.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикРабот.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРабот</name>
    <type>
      <types>EnumRef.ВКМ_ГрафикРабот</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_ПодразделенияСотрудников</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Yourcomputermaster/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
Функция ОкладСуммаСреднеГодовая(ПериодНачало, Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СРЕДНЕЕ(ВКМ_ОсновоныеНачисления.Сумма) КАК СуммаОклад
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновоныеНачисления КАК ВКМ_ОсновоныеНачисления
	               |ГДЕ
	               |	ВКМ_ОсновоныеНачисления.ВидРасчета = &ВидРасчета
	               |	И ВКМ_ОсновоныеНачисления.Сотрудник = &Сотрудник
	               |	И ВКМ_ОсновоныеНачисления.ПериодДействияНачало МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачало, МЕСЯЦ, -12), МЕСЯЦ) И &ПериодНачало";
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.СуммаОклад;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
#КонецОбласти

#КонецЕсли
